const fruitIcons = ["🍉", "🍌", "🍎", "🍇", "🍑", "🍓", "🍋", "🥝", "🍒", "🥥"];

const animalIcons = [
    "🐶",
    "🐱",
    "🐭",
    "🐹",
    "🐰",
    "🦊",
    "🐻",
    "🐼",
    "🐨",
    "🐯",
];

const natureIcons = [
    "🌸",
    "🌼",
    "🌻",
    "🌹",
    "🌷",
    "🌱",
    "🌿",
    "🍃",
    "🍂",
    "🍁",
];

const sportIcons = ["⚽", "🏀", "⚾", "🏈", "🎾", "🏐", "🏉", "🎱", "🏓", "🏸"];

const vehicleIcons = [
    "🚗",
    "🚕",
    "🚙",
    "🚌",
    "🚎",
    "🚓",
    "🚑",
    "🚒",
    "🚐",
    "🚜",
];

const foodIcons = ["🍕", "🍔", "🍟", "🌭", "🍿", "🍣", "🍱", "🥟", "🍜", "🍦"];

const musicIcons = ["🎸", "🎷", "🎺", "🎻", "🥁", "🎹", "🎤", "🎧", "🎼", "🎵"];

const fantasyIcons = [
    "🧙‍♂️",
    "🧝‍♀️",
    "🧚‍♂️",
    "🧜‍♀️",
    "🧞‍♂️",
    "🧟‍♂️",
    "🧛‍♂️",
    "🦄",
    "🐉",
    "🐲",
];

const spaceIcons = ["🚀", "🛸", "🛰️", "🌍", "🌕", "🌟", "🌌", "🪐", "👽", "🌠"];

const faceIcons = ["😀", "😁", "😂", "🥶", "🥵", "😅", "😆", "😉", "😊", "😋"];

const weatherIcons = [
    "☀️",
    "🌤️",
    "⛅",
    "🌥️",
    "🌦️",
    "🌧️",
    "⛈️",
    "🌩️",
    "🌨️",
    "🌪️",
];

const professionIcons = [
    "👮‍♂️",
    "👷‍♀️",
    "💂‍♂️",
    "👩‍🚒",
    "👨‍🌾",
    "👩‍🍳",
    "👨‍🔧",
    "👩‍🏫",
    "👨‍💼",
    "👩‍🔬",
];

const holidayIcons = [
    "🎄",
    "🎃",
    "🎇",
    "🕎",
    "🎉",
    "🎁",
    "🕯️",
    "🍀",
    "🐰",
    "🦃",
];

const landmarkIcons = [
    "🗽",
    "🗼",
    "⛩️",
    "🕌",
    "🏰",
    "🏯",
    "🏟️",
    "🏛️",
    "🕍",
    "🏖️",
];

const colorIcons = ["🟥", "🟧", "🟨", "🟩", "🟦", "🟪", "🟫", "⬛", "⬜", "❤️"];

const paintingIcons = [
    "🎨",
    "🖼️",
    "🖌️",
    "🖋️",
    "🖍️",
    "📝",
    "✏️",
    "📐",
    "📏",
    "🖊️",
];

const mathIcons = ["➕", "➖", "✖️", "➗", "∑", "√", "∫", "∞", "≠", "≈"];

const fashionIcons = [
    "👗",
    "👠",
    "👒",
    "👓",
    "👜",
    "💼",
    "👔",
    "👖",
    "👚",
    "👟",
];

const boardGamesIcons = [
    "🎲",
    "🧩",
    "🃏",
    "🎴",
    "🎰",
    "🎮",
    "🎯",
    "🎳",
    "🀄",
    "🏁",
];

const videoGamesIcons = [
    "🎮",
    "🕹️",
    "🎲",
    "🕹️",
    "🎯",
    "🎳",
    "🎰",
    "🎮",
    "🕹️",
    "🎲",
];

const coffeeTeaIcons = [
    "☕️",
    "🍵",
    "🫖",
    "🥤",
    "🥛",
    "🥄",
    "🍰",
    "🍪",
    "🥐",
    "🥯",
];

const animal2Icons = [
    "🐅",
    "🦓",
    "🐆",
    "🦍",
    "🐘",
    "🦏",
    "🦛",
    "🐪",
    "🐫",
    "🦒",
];

const workoutIcons = [
    "🏋️‍♂️",
    "🚴‍♀️",
    "🏃‍♂️",
    "🏋️‍♀️",
    "🔥",
    "🏃‍♀️",
    "🧘‍♀️",
    "🍗",
    "💪",
    "🥊",
];

const kitchenUtensilsIcons = [
    "🍴",
    "🍽️",
    "🥄",
    "🥢",
    "🍵",
    "🍶",
    "🍳",
    "🥘",
    "🔪",
    "👨‍🍳",
];

const dessertsIcons = [
    "🍰",
    "🎂",
    "🧁",
    "🍮",
    "🍩",
    "🍪",
    "🍫",
    "🍬",
    "🍭",
    "🍦",
];

const aquaticAnimalsIcons = [
    "🐠",
    "🐟",
    "🐡",
    "🦈",
    "🐋",
    "🐳",
    "🐙",
    "🦑",
    "🦞",
    "🦀",
];

const hauntedHouseIcons = [
    "👻",
    "🎃",
    "🕸️",
    "🕯️",
    "🕷️",
    "🦇",
    "🏚️",
    "🚪",
    "🖼️",
    "🪦",
];

const timeTravelIcons = [
    "⏳",
    "⏰",
    "🕰️",
    "🔙",
    "🔜",
    "⏱️",
    "🔄",
    "🕛",
    "⌚",
    "🕥",
];

const trafficIcons = [
    "🚦",
    "🚧",
    "⛔",
    "🚸",
    "⚠️",
    "🛑",
    "🚥",
    "🚏",
    "🚗",
    "🏍️",
];

const medievalIcons = [
    "⚔️",
    "🛡️",
    "🗡️",
    "🏹",
    "🏰",
    "👑",
    "🤴",
    "👸",
    "🎩",
    "🔮",
];

export const icons = [
    fruitIcons,
    animalIcons,
    natureIcons,
    sportIcons,
    vehicleIcons,
    foodIcons,
    musicIcons,
    fantasyIcons,
    spaceIcons,
    faceIcons,
    weatherIcons,
    professionIcons,
    holidayIcons,
    landmarkIcons,
    colorIcons,
    paintingIcons,
    fashionIcons,
    mathIcons,
    boardGamesIcons,
    videoGamesIcons,
    coffeeTeaIcons,
    animal2Icons,
    workoutIcons,
    kitchenUtensilsIcons,
    dessertsIcons,
    aquaticAnimalsIcons,
    hauntedHouseIcons,
    timeTravelIcons,
    trafficIcons,
    medievalIcons,
];
